* development
  :LOGBOOK:
  CLOCK: [2017-04-05 Mit 17:20]--[2017-04-05 Mit 18:18] =>  0:58
  CLOCK: [2017-04-05 Mit 14:27]--[2017-04-05 Mit 15:32] =>  1:05
  CLOCK: [2017-04-05 Mit 12:55]--[2017-04-05 Mit 14:11] =>  1:16
  CLOCK: [2017-04-03 Mon 17:18]--[2017-04-03 Mon 18:18] =>  1:00
  CLOCK: [2017-04-03 Mon 16:36]--[2017-04-03 Mon 16:37] =>  0:01
  CLOCK: [2017-04-03 Mon 15:32]--[2017-04-03 Mon 15:36] =>  0:04
  CLOCK: [2017-04-03 Mon 14:14]--[2017-04-03 Mon 14:54] =>  0:40
  CLOCK: [2017-04-03 Mon 12:55]--[2017-04-03 Mon 13:00] =>  0:05
  CLOCK: [2017-04-03 Mon 11:59]--[2017-04-03 Mon 12:35] =>  0:36
  :END:
** refactoring
   :LOGBOOK:
   CLOCK: [2017-04-06 Don 13:02]--[2017-04-06 Don 13:31] =>  0:29
   CLOCK: [2017-04-06 Don 10:35]--[2017-04-06 Don 12:21] =>  1:46
   CLOCK: [2017-04-05 Mit 22:28]--[2017-04-05 Mit 22:32] =>  0:04
   CLOCK: [2017-04-03 Mon 09:16]--[2017-04-03 Mon 09:52] =>  0:36
   CLOCK: [2017-04-02 Son 17:18]--[2017-04-02 Son 17:38] =>  0:20
   CLOCK: [2017-04-02 Son 15:25]--[2017-04-02 Son 15:27] =>  0:02
   CLOCK: [2017-04-02 Son 14:57]--[2017-04-02 Son 15:16] =>  0:19
   CLOCK: [2017-04-02 Son 11:13]--[2017-04-02 Son 12:26] =>  1:13
   :END:
** testing
   :LOGBOOK:
   CLOCK: [2017-04-07 Fre 16:21]--[2017-04-07 Fre 17:06] =>  0:45
   CLOCK: [2017-04-07 Fre 12:39]--[2017-04-07 Fre 14:00] =>  1:21
   CLOCK: [2017-04-05 Mit 12:50]--[2017-04-05 Mit 12:55] =>  0:05
   CLOCK: [2017-04-05 Mit 12:03]--[2017-04-05 Mit 12:36] =>  0:33
   CLOCK: [2017-04-05 Mit 11:35]--[2017-04-05 Mit 11:52] =>  0:17
   CLOCK: [2017-04-03 Mon 17:12]--[2017-04-03 Mon 17:18] =>  0:06
   CLOCK: [2017-04-03 Mon 16:37]--[2017-04-03 Mon 17:01] =>  0:24
   CLOCK: [2017-04-03 Mon 16:05]--[2017-04-03 Mon 16:36] =>  0:31
   CLOCK: [2017-04-03 Mon 15:36]--[2017-04-03 Mon 15:37] =>  0:01
   :END:
* Verification
** datastructures sertification
*** vector
    :LOGBOOK:
    CLOCK: [2017-05-08 Mon 15:33]--[2017-05-08 Mon 15:49] =>  0:16
    CLOCK: [2017-05-08 Mon 15:14]--[2017-05-08 Mon 15:32] =>  0:18
    CLOCK: [2017-05-08 Mon 13:23]--[2017-05-08 Mon 15:10] =>  1:47
    :END:
*** map
    :LOGBOOK:
    CLOCK: [2017-05-08 Mon 17:51]--[2017-05-08 Mon 18:00] =>  0:09
    CLOCK: [2017-05-08 Mon 17:32]--[2017-05-08 Mon 17:50] =>  0:18
    CLOCK: [2017-05-08 Mon 15:51]--[2017-05-08 Mon 16:02] =>  0:11
    :END:
** symbolic models
   :LOGBOOK:
   CLOCK: [2017-05-01 Mon 17:58]--[2017-05-01 Mon 18:04] =>  0:06
   CLOCK: [2017-04-28 Fre 17:32]--[2017-04-28 Fre 17:49] =>  0:17
   CLOCK: [2017-04-26 Mit 14:08]--[2017-04-26 Mit 14:29] =>  0:21
   CLOCK: [2017-04-24 Mon 15:29]--[2017-04-24 Mon 15:48] =>  0:19
   CLOCK: [2017-04-17 Mon 15:48]--[2017-04-17 Mon 16:03] =>  0:15
   CLOCK: [2017-04-17 Mon 14:51]--[2017-04-17 Mon 15:32] =>  0:41
   CLOCK: [2017-04-17 Mon 14:20]--[2017-04-17 Mon 14:40] =>  0:20
   CLOCK: [2017-04-17 Mon 13:51]--[2017-04-17 Mon 14:05] =>  0:14
   CLOCK: [2017-04-17 Mon 10:49]--[2017-04-17 Mon 11:28] =>  0:39
   CLOCK: [2017-04-17 Mon 10:18]--[2017-04-17 Mon 10:31] =>  0:13
   CLOCK: [2017-04-16 Son 19:00]--[2017-04-16 Son 20:14] =>  1:14
   CLOCK: [2017-04-16 Son 11:56]--[2017-04-16 Son 12:25] =>  0:29
   :END:
** API contracts
   :LOGBOOK:
   CLOCK: [2017-05-08 Mon 16:02]--[2017-05-08 Mon 16:32] =>  0:30
   CLOCK: [2017-05-04 Don 10:09]--[2017-05-04 Don 10:19] =>  0:10
   CLOCK: [2017-04-28 Fre 17:30]--[2017-04-28 Fre 17:32] =>  0:02
   CLOCK: [2017-04-18 Die 15:47]--[2017-04-18 Die 16:15] =>  0:28
   CLOCK: [2017-04-18 Die 15:42]--[2017-04-18 Die 15:47] =>  0:05
   CLOCK: [2017-04-18 Die 12:29]--[2017-04-18 Die 12:42] =>  0:13
   CLOCK: [2017-04-18 Die 11:39]--[2017-04-18 Die 11:43] =>  0:04
   CLOCK: [2017-04-18 Die 11:11]--[2017-04-18 Die 11:38] =>  0:27
   CLOCK: [2017-04-17 Mon 19:06]--[2017-04-17 Mon 19:29] =>  0:23
   CLOCK: [2017-04-17 Mon 18:32]--[2017-04-17 Mon 19:00] =>  0:28
   CLOCK: [2017-04-17 Mon 17:03]--[2017-04-17 Mon 17:40] =>  0:37
   :END:
** Validator plugin
   :LOGBOOK:
   CLOCK: [2017-05-21 Son 17:01]--[2017-05-21 Son 17:14] =>  0:13
   CLOCK: [2017-05-21 Son 12:23]--[2017-05-21 Son 12:30] =>  0:07
   CLOCK: [2017-05-18 Don 21:19]--[2017-05-18 Don 21:19] =>  0:00
   CLOCK: [2017-05-18 Don 21:03]--[2017-05-18 Don 21:05] =>  0:02
   CLOCK: [2017-05-18 Don 20:34]--[2017-05-18 Don 20:48] =>  0:14
   CLOCK: [2017-05-08 Mon 11:06]--[2017-05-08 Mon 11:29] =>  0:23
   CLOCK: [2017-05-08 Mon 08:54]--[2017-05-08 Mon 09:16] =>  0:22
   CLOCK: [2017-05-04 Don 20:19]--[2017-05-04 Don 20:20] =>  0:01
   CLOCK: [2017-05-04 Don 17:41]--[2017-05-04 Don 18:40] =>  0:59
   CLOCK: [2017-05-01 Mon 10:55]--[2017-05-01 Mon 10:57] =>  0:02
   CLOCK: [2017-04-30 Son 11:44]--[2017-04-30 Son 11:47] =>  0:03
   CLOCK: [2017-04-28 Fre 17:49]--[2017-04-28 Fre 17:53] =>  0:04
   CLOCK: [2017-04-28 Fre 17:22]--[2017-04-28 Fre 17:30] =>  0:08
   CLOCK: [2017-04-28 Fre 15:26]--[2017-04-28 Fre 15:38] =>  0:12
   CLOCK: [2017-04-28 Fre 13:26]--[2017-04-28 Fre 13:49] =>  0:23
   CLOCK: [2017-04-27 Don 16:01]--[2017-04-27 Don 16:35] =>  0:34
   CLOCK: [2017-04-26 Mit 17:33]--[2017-04-26 Mit 17:35] =>  0:02
   CLOCK: [2017-04-26 Mit 14:29]--[2017-04-26 Mit 15:42] =>  1:13
   CLOCK: [2017-04-24 Mon 16:38]--[2017-04-24 Mon 17:09] =>  0:31
   CLOCK: [2017-04-24 Mon 15:19]--[2017-04-24 Mon 15:29] =>  0:10
   CLOCK: [2017-04-24 Mon 14:34]--[2017-04-24 Mon 15:03] =>  0:29
   CLOCK: [2017-04-24 Mon 13:54]--[2017-04-24 Mon 14:00] =>  0:06
   CLOCK: [2017-04-24 Mon 12:59]--[2017-04-24 Mon 13:38] =>  0:39
   CLOCK: [2017-04-24 Mon 12:04]--[2017-04-24 Mon 12:49] =>  0:45
   CLOCK: [2017-04-24 Mon 10:56]--[2017-04-24 Mon 11:38] =>  0:42
   CLOCK: [2017-04-24 Mon 10:28]--[2017-04-24 Mon 10:43] =>  0:15
   CLOCK: [2017-04-23 Son 16:43]--[2017-04-23 Son 17:32] =>  0:49
   CLOCK: [2017-04-23 Son 12:26]--[2017-04-23 Son 13:02] =>  0:36
   CLOCK: [2017-04-21 Fre 15:23]--[2017-04-21 Fre 15:48] =>  0:25
   CLOCK: [2017-04-20 Don 14:06]--[2017-04-20 Don 14:09] =>  0:03
   CLOCK: [2017-04-20 Don 13:49]--[2017-04-20 Don 14:00] =>  0:11
   CLOCK: [2017-04-20 Don 12:10]--[2017-04-20 Don 12:27] =>  0:17
   CLOCK: [2017-04-20 Don 11:56]--[2017-04-20 Don 12:03] =>  0:07
   CLOCK: [2017-04-20 Don 11:17]--[2017-04-20 Don 11:51] =>  0:34
   CLOCK: [2017-04-19 Mit 18:46]--[2017-04-19 Mit 19:09] =>  0:23
   CLOCK: [2017-04-19 Mit 18:25]--[2017-04-19 Mit 18:44] =>  0:19
   CLOCK: [2017-04-19 Mit 17:53]--[2017-04-19 Mit 18:02] =>  0:09
   CLOCK: [2017-04-19 Mit 16:05]--[2017-04-19 Mit 17:16] =>  1:11
   CLOCK: [2017-04-19 Mit 15:41]--[2017-04-19 Mit 15:48] =>  0:07
   CLOCK: [2017-04-19 Mit 12:57]--[2017-04-19 Mit 13:07] =>  0:10
   CLOCK: [2017-04-19 Mit 11:40]--[2017-04-19 Mit 12:37] =>  0:57
   CLOCK: [2017-04-18 Die 17:25]--[2017-04-18 Die 17:49] =>  0:24
   CLOCK: [2017-04-18 Die 16:16]--[2017-04-18 Die 16:42] =>  0:26
   :END:
*** Improve validator itself
**** Enable type-guessing for void* arguments
     :LOGBOOK:
     CLOCK: [2017-05-01 Mon 20:52]--[2017-05-01 Mon 21:13] =>  0:21
     CLOCK: [2017-04-30 Son 09:31]--[2017-04-30 Son 11:00] =>  1:29
     CLOCK: [2017-04-23 Son 11:51]--[2017-04-23 Son 12:26] =>  0:35
     CLOCK: [2017-04-21 Fre 14:33]--[2017-04-21 Fre 15:22] =>  0:49
     CLOCK: [2017-04-21 Fre 13:02]--[2017-04-21 Fre 13:38] =>  0:36
     CLOCK: [2017-04-21 Fre 11:32]--[2017-04-21 Fre 12:02] =>  0:30
     CLOCK: [2017-04-20 Don 16:20]--[2017-04-20 Don 17:46] =>  1:26
     CLOCK: [2017-04-20 Don 15:56]--[2017-04-20 Don 15:59] =>  0:03
     :END:
**** Auto-type conversion
     :LOGBOOK:
     CLOCK: [2017-05-02 Die 12:55]--[2017-05-02 Die 12:58] =>  0:03
     CLOCK: [2017-05-01 Mon 22:44]--[2017-05-01 Mon 22:48] =>  0:04
     CLOCK: [2017-04-27 Don 14:08]--[2017-04-27 Don 14:44] =>  0:36
     CLOCK: [2017-04-27 Don 12:33]--[2017-04-27 Don 13:13] =>  0:40
     CLOCK: [2017-04-26 Mit 18:42]--[2017-04-26 Mit 19:11] =>  0:29
     :END:
**** Memory model
     :LOGBOOK:
     CLOCK: [2017-05-22 Mon 09:40]--[2017-05-22 Mon 10:08] =>  0:28
     CLOCK: [2017-05-21 Son 16:26]--[2017-05-21 Son 17:00] =>  0:34
     CLOCK: [2017-05-21 Son 12:30]--[2017-05-21 Son 12:38] =>  0:08
     CLOCK: [2017-05-21 Son 10:18]--[2017-05-21 Son 12:21] =>  2:03
     CLOCK: [2017-05-19 Fre 18:45]--[2017-05-19 Fre 19:36] =>  0:51
     CLOCK: [2017-05-19 Fre 14:19]--[2017-05-19 Fre 15:15] =>  0:56
     CLOCK: [2017-05-18 Don 21:19]--[2017-05-18 Don 21:35] =>  0:16
     CLOCK: [2017-04-28 Fre 13:09]--[2017-04-28 Fre 13:25] =>  0:16
     CLOCK: [2017-04-27 Don 18:39]--[2017-04-27 Don 19:13] =>  0:34
     CLOCK: [2017-04-27 Don 17:29]--[2017-04-27 Don 18:37] =>  1:08
     CLOCK: [2017-04-27 Don 16:35]--[2017-04-27 Don 17:21] =>  0:46
     :END:
**** Type tags
     :LOGBOOK:
     CLOCK: [2017-05-01 Mon 18:04]--[2017-05-01 Mon 18:47] =>  0:43
     CLOCK: [2017-05-01 Mon 17:39]--[2017-05-01 Mon 17:58] =>  0:19
     CLOCK: [2017-05-01 Mon 16:08]--[2017-05-01 Mon 17:39] =>  1:31
     CLOCK: [2017-05-01 Mon 15:13]--[2017-05-01 Mon 16:05] =>  0:52
     CLOCK: [2017-05-01 Mon 11:22]--[2017-05-01 Mon 13:42] =>  2:20
     CLOCK: [2017-05-01 Mon 10:57]--[2017-05-01 Mon 11:13] =>  0:16
     :END:
**** Double pointer output arguments 
     :LOGBOOK:
     CLOCK: [2017-05-22 Mon 09:40]--[2017-05-22 Mon 09:40] =>  0:00
     CLOCK: [2017-05-18 Don 20:48]--[2017-05-18 Don 21:03] =>  0:15
     CLOCK: [2017-05-05 Fre 16:26]--[2017-05-05 Fre 16:50] =>  0:24
     CLOCK: [2017-05-05 Fre 14:39]--[2017-05-05 Fre 15:27] =>  0:48
     CLOCK: [2017-05-05 Fre 12:50]--[2017-05-05 Fre 14:01] =>  1:11
     CLOCK: [2017-05-04 Don 20:54]--[2017-05-04 Don 22:19] =>  1:25
     CLOCK: [2017-05-04 Don 20:20]--[2017-05-04 Don 20:21] =>  0:01
     CLOCK: [2017-05-04 Don 17:09]--[2017-05-04 Don 17:41] =>  0:32
     CLOCK: [2017-05-04 Don 11:50]--[2017-05-04 Don 12:51] =>  1:01
     CLOCK: [2017-05-04 Don 10:19]--[2017-05-04 Don 11:33] =>  1:14
     :END:
**** Unidirectional argument pointer tracing
     :LOGBOOK:
     CLOCK: [2017-05-04 Don 17:09]--[2017-05-04 Don 17:09] =>  0:00
     CLOCK: [2017-05-04 Don 15:22]--[2017-05-04 Don 16:36] =>  1:14
     :END:
**** Extended lemmas arguments
     :LOGBOOK:
     CLOCK: [2017-05-21 Son 22:48]--[2017-05-21 Son 23:20] =>  0:32
     CLOCK: [2017-05-21 Son 17:14]--[2017-05-21 Son 17:15] =>  0:01
     :END:
**** Arg-pointer postcondition handling
     :LOGBOOK:
     CLOCK: [2017-05-22 Mon 09:35]--[2017-05-22 Mon 09:38] =>  0:03
     :END:



